Процедура ПередЗаписью(Отказ)
	
	// Проверка уникальности наименования товара
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	1 КАК ПолеРезультата
		|ИЗ
		|	Справочник.Товары КАК Товары
		|ГДЕ
		|	Товары.Наименование = &Наименование
		|	И Товары.Ссылка <> &Ссылка
		|	И НЕ Товары.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("Наименование", Наименование);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Результат = Запрос.Выполнить();
		
		Если Не Результат.Пустой() Тогда
			Сообщить("Товар с таким наименованием уже существует в справочнике.");
			Отказ = Истина;
		КонецЕсли;
	
КонецПроцедуры
