// Пересчет суммы по строке и документа
&НаКлиенте
Процедура ПересчитатьСумму()
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекСтрока.Сумма = ТекСтрока.Цена * ТекСтрока.Количество;
	Объект.СуммаИтого = Объект.Товары.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ПересчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ПересчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыТоварПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ТекСтрока.Цена = ПолучитьЦенуТовара(ТекСтрока.Товар);
	
	ПересчитатьСумму();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуТовара(Товар)
	
	Если Товар = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат Товар.Цена;
	
КонецФункции
